Tarefas/app/controllers/tarefas_controller.rb

  def index
    @tarefas = Tarefa.all
---
SELECT `tarefas`.* FROM `tarefas`

  def create
    @tarefa = Tarefa.new(tarefa_params)

    respond_to do |format|
      if @tarefa.save
---
INSERT INTO `tarefas` (`Nome`, `Descricao`, `Prioridade`, `DataPrazo`, `created_at`, `updated_at`) VALUES ('fushdf', 'flkjsdlfkj', 5, 4, '2017-06-13 16:29:20', '2017-06-13 16:29:20')

    def set_tarefa
      @tarefa = Tarefa.find(params[:id])
---
SELECT  `tarefas`.* FROM `tarefas` WHERE `tarefas`.`id` = 1 LIMIT 1